; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p16---int100n150-m25---int100c150---s372---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 - fuellevel
)

(:init
(sum level0 level12 level12)
(sum level0 level13 level13)
(sum level0 level25 level25)
(sum level1 level12 level13)
(sum level1 level13 level14)
(sum level1 level25 level26)
(sum level2 level12 level14)
(sum level2 level13 level15)
(sum level2 level25 level27)
(sum level3 level12 level15)
(sum level3 level13 level16)
(sum level3 level25 level28)
(sum level4 level12 level16)
(sum level4 level13 level17)
(sum level4 level25 level29)
(sum level5 level12 level17)
(sum level5 level13 level18)
(sum level5 level25 level30)
(sum level6 level12 level18)
(sum level6 level13 level19)
(sum level6 level25 level31)
(sum level7 level12 level19)
(sum level7 level13 level20)
(sum level7 level25 level32)
(sum level8 level12 level20)
(sum level8 level13 level21)
(sum level8 level25 level33)
(sum level9 level12 level21)
(sum level9 level13 level22)
(sum level9 level25 level34)
(sum level10 level12 level22)
(sum level10 level13 level23)
(sum level10 level25 level35)
(sum level11 level12 level23)
(sum level11 level13 level24)
(sum level11 level25 level36)
(sum level12 level12 level24)
(sum level12 level13 level25)
(sum level12 level25 level37)
(sum level13 level12 level25)
(sum level13 level13 level26)
(sum level13 level25 level38)
(sum level14 level12 level26)
(sum level14 level13 level27)
(sum level14 level25 level39)
(sum level15 level12 level27)
(sum level15 level13 level28)
(sum level15 level25 level40)
(sum level16 level12 level28)
(sum level16 level13 level29)
(sum level16 level25 level41)
(sum level17 level12 level29)
(sum level17 level13 level30)
(sum level17 level25 level42)
(sum level18 level12 level30)
(sum level18 level13 level31)
(sum level18 level25 level43)
(sum level19 level12 level31)
(sum level19 level13 level32)
(sum level19 level25 level44)
(sum level20 level12 level32)
(sum level20 level13 level33)
(sum level20 level25 level45)
(sum level21 level12 level33)
(sum level21 level13 level34)
(sum level21 level25 level46)
(sum level22 level12 level34)
(sum level22 level13 level35)
(sum level22 level25 level47)
(sum level23 level12 level35)
(sum level23 level13 level36)
(sum level23 level25 level48)
(sum level24 level12 level36)
(sum level24 level13 level37)
(sum level24 level25 level49)
(sum level25 level12 level37)
(sum level25 level13 level38)
(sum level25 level25 level50)
(sum level26 level12 level38)
(sum level26 level13 level39)
(sum level26 level25 level51)
(sum level27 level12 level39)
(sum level27 level13 level40)
(sum level27 level25 level52)
(sum level28 level12 level40)
(sum level28 level13 level41)
(sum level28 level25 level53)
(sum level29 level12 level41)
(sum level29 level13 level42)
(sum level29 level25 level54)
(sum level30 level12 level42)
(sum level30 level13 level43)
(sum level30 level25 level55)
(sum level31 level12 level43)
(sum level31 level13 level44)
(sum level31 level25 level56)
(sum level32 level12 level44)
(sum level32 level13 level45)
(sum level32 level25 level57)
(sum level33 level12 level45)
(sum level33 level13 level46)
(sum level33 level25 level58)
(sum level34 level12 level46)
(sum level34 level13 level47)
(sum level34 level25 level59)
(sum level35 level12 level47)
(sum level35 level13 level48)
(sum level35 level25 level60)
(sum level36 level12 level48)
(sum level36 level13 level49)
(sum level36 level25 level61)
(sum level37 level12 level49)
(sum level37 level13 level50)
(sum level37 level25 level62)
(sum level38 level12 level50)
(sum level38 level13 level51)
(sum level38 level25 level63)
(sum level39 level12 level51)
(sum level39 level13 level52)
(sum level39 level25 level64)
(sum level40 level12 level52)
(sum level40 level13 level53)
(sum level40 level25 level65)
(sum level41 level12 level53)
(sum level41 level13 level54)
(sum level41 level25 level66)
(sum level42 level12 level54)
(sum level42 level13 level55)
(sum level42 level25 level67)
(sum level43 level12 level55)
(sum level43 level13 level56)
(sum level43 level25 level68)
(sum level44 level12 level56)
(sum level44 level13 level57)
(sum level44 level25 level69)
(sum level45 level12 level57)
(sum level45 level13 level58)
(sum level45 level25 level70)
(sum level46 level12 level58)
(sum level46 level13 level59)
(sum level46 level25 level71)
(sum level47 level12 level59)
(sum level47 level13 level60)
(sum level47 level25 level72)
(sum level48 level12 level60)
(sum level48 level13 level61)
(sum level48 level25 level73)
(sum level49 level12 level61)
(sum level49 level13 level62)
(sum level49 level25 level74)
(sum level50 level12 level62)
(sum level50 level13 level63)
(sum level50 level25 level75)
(sum level51 level12 level63)
(sum level51 level13 level64)
(sum level51 level25 level76)
(sum level52 level12 level64)
(sum level52 level13 level65)
(sum level52 level25 level77)
(sum level53 level12 level65)
(sum level53 level13 level66)
(sum level53 level25 level78)
(sum level54 level12 level66)
(sum level54 level13 level67)
(sum level54 level25 level79)
(sum level55 level12 level67)
(sum level55 level13 level68)
(sum level55 level25 level80)
(sum level56 level12 level68)
(sum level56 level13 level69)
(sum level56 level25 level81)
(sum level57 level12 level69)
(sum level57 level13 level70)
(sum level57 level25 level82)
(sum level58 level12 level70)
(sum level58 level13 level71)
(sum level58 level25 level83)
(sum level59 level12 level71)
(sum level59 level13 level72)
(sum level59 level25 level84)
(sum level60 level12 level72)
(sum level60 level13 level73)
(sum level60 level25 level85)
(sum level61 level12 level73)
(sum level61 level13 level74)
(sum level61 level25 level86)
(sum level62 level12 level74)
(sum level62 level13 level75)
(sum level62 level25 level87)
(sum level63 level12 level75)
(sum level63 level13 level76)
(sum level63 level25 level88)
(sum level64 level12 level76)
(sum level64 level13 level77)
(sum level64 level25 level89)
(sum level65 level12 level77)
(sum level65 level13 level78)
(sum level65 level25 level90)
(sum level66 level12 level78)
(sum level66 level13 level79)
(sum level66 level25 level91)
(sum level67 level12 level79)
(sum level67 level13 level80)
(sum level67 level25 level92)
(sum level68 level12 level80)
(sum level68 level13 level81)
(sum level68 level25 level93)
(sum level69 level12 level81)
(sum level69 level13 level82)
(sum level70 level12 level82)
(sum level70 level13 level83)
(sum level71 level12 level83)
(sum level71 level13 level84)
(sum level72 level12 level84)
(sum level72 level13 level85)
(sum level73 level12 level85)
(sum level73 level13 level86)
(sum level74 level12 level86)
(sum level74 level13 level87)
(sum level75 level12 level87)
(sum level75 level13 level88)
(sum level76 level12 level88)
(sum level76 level13 level89)
(sum level77 level12 level89)
(sum level77 level13 level90)
(sum level78 level12 level90)
(sum level78 level13 level91)
(sum level79 level12 level91)
(sum level79 level13 level92)
(sum level80 level12 level92)
(sum level80 level13 level93)
(sum level81 level12 level93)

(connected l0 l1)
(fuelcost level25 l0 l1)
(connected l0 l2)
(fuelcost level13 l0 l2)
(connected l1 l0)
(fuelcost level25 l1 l0)
(connected l1 l2)
(fuelcost level12 l1 l2)
(connected l2 l0)
(fuelcost level13 l2 l0)
(connected l2 l1)
(fuelcost level12 l2 l1)

(at t0 l2)
(fuel t0 level93)
(= (total-cost) 0)

(at p0 l0)
(at p1 l0)
(at p2 l0)
(at p3 l2)
(at p4 l2)
(at p5 l1)
(at p6 l0)
(at p7 l2)
(at p8 l0)
(at p9 l1)
(at p10 l1)
(at p11 l1)
(at p12 l1)
(at p13 l2)
(at p14 l2)
(at p15 l0)
)

(:goal
(and
(at p0 l2)
(at p1 l1)
(at p2 l1)
(at p3 l0)
(at p4 l0)
(at p5 l2)
(at p6 l2)
(at p7 l1)
(at p8 l1)
(at p9 l0)
(at p10 l0)
(at p11 l2)
(at p12 l0)
(at p13 l0)
(at p14 l0)
(at p15 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p7 t0 l2)
   deleted: (at p7 l2)
   added: (in p7 t0)
   goals met: 0 of 16
2. (load p4 t0 l2)
   deleted: (at p4 l2)
   added: (in p4 t0)
   goals met: 0 of 16
3. (load p3 t0 l2)
   deleted: (at p3 l2)
   added: (in p3 t0)
   goals met: 0 of 16
4. (load p14 t0 l2)
   deleted: (at p14 l2)
   added: (in p14 t0)
   goals met: 0 of 16
5. (load p13 t0 l2)
   deleted: (at p13 l2)
   added: (in p13 t0)
   goals met: 0 of 16
6. (drive t0 l2 l1 level81 level12 level93)
   deleted: (at t0 l2) (fuel t0 level93)
   added: (at t0 l1) (fuel t0 level81)
   goals met: 0 of 16
7. (load p9 t0 l1)
   deleted: (at p9 l1)
   added: (in p9 t0)
   goals met: 0 of 16
8. (load p12 t0 l1)
   deleted: (at p12 l1)
   added: (in p12 t0)
   goals met: 0 of 16
9. (load p10 t0 l1)
   deleted: (at p10 l1)
   added: (in p10 t0)
   goals met: 0 of 16
10. (drive t0 l1 l0 level56 level25 level81)
   deleted: (at t0 l1) (fuel t0 level81)
   added: (at t0 l0) (fuel t0 level56)
   goals met: 0 of 16
11. (unload p9 t0 l0)
   deleted: (in p9 t0)
   added: (at p9 l0)
   goals met: 1 of 16
12. (unload p4 t0 l0)
   deleted: (in p4 t0)
   added: (at p4 l0)
   goals met: 2 of 16
13. (unload p3 t0 l0)
   deleted: (in p3 t0)
   added: (at p3 l0)
   goals met: 3 of 16
14. (unload p14 t0 l0)
   deleted: (in p14 t0)
   added: (at p14 l0)
   goals met: 4 of 16
15. (unload p13 t0 l0)
   deleted: (in p13 t0)
   added: (at p13 l0)
   goals met: 5 of 16
16. (unload p12 t0 l0)
   deleted: (in p12 t0)
   added: (at p12 l0)
   goals met: 6 of 16
17. (unload p10 t0 l0)
   deleted: (in p10 t0)
   added: (at p10 l0)
   goals met: 7 of 16
18. (load p8 t0 l0)
   deleted: (at p8 l0)
   added: (in p8 t0)
   goals met: 7 of 16
19. (load p6 t0 l0)
   deleted: (at p6 l0)
   added: (in p6 t0)
   goals met: 7 of 16
20. (load p2 t0 l0)
   deleted: (at p2 l0)
   added: (in p2 t0)
   goals met: 7 of 16
21. (load p15 t0 l0)
   deleted: (at p15 l0)
   added: (in p15 t0)
   goals met: 7 of 16
22. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 7 of 16
23. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 7 of 16
24. (drive t0 l0 l1 level31 level25 level56)
   deleted: (at t0 l0) (fuel t0 level56)
   added: (at t0 l1) (fuel t0 level31)
   goals met: 7 of 16
25. (load p11 t0 l1)
   deleted: (at p11 l1)
   added: (in p11 t0)
   goals met: 7 of 16
26. (load p5 t0 l1)
   deleted: (at p5 l1)
   added: (in p5 t0)
   goals met: 7 of 16
27. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 8 of 16
28. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 9 of 16
29. (unload p7 t0 l1)
   deleted: (in p7 t0)
   added: (at p7 l1)
   goals met: 10 of 16
30. (unload p8 t0 l1)
   deleted: (in p8 t0)
   added: (at p8 l1)
   goals met: 11 of 16
31. (drive t0 l1 l2 level19 level12 level31)
   deleted: (at t0 l1) (fuel t0 level31)
   added: (at t0 l2) (fuel t0 level19)
   goals met: 11 of 16
32. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 12 of 16
33. (unload p11 t0 l2)
   deleted: (in p11 t0)
   added: (at p11 l2)
   goals met: 13 of 16
34. (unload p15 t0 l2)
   deleted: (in p15 t0)
   added: (at p15 l2)
   goals met: 14 of 16
35. (unload p5 t0 l2)
   deleted: (in p5 t0)
   added: (at p5 l2)
   goals met: 15 of 16
36. (unload p6 t0 l2)
   deleted: (in p6 t0)
   added: (at p6 l2)
   goals met: 16 of 16
